// Задача 10: Напишите программу, которая принимает на вход трёхзначное
// число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

/*
int findSecNum(int num)
{
    int secondThird = num % 100;
    int second = secondThird / 10;
    return second;
}

Console.Write("Enter a number: ");
int num = Convert.ToInt32(Console.ReadLine());

int result = findSecNum(num);
Console.Write($"Second number is {result} of {num}");
*/





